app/controllers/journal_controller.rb

  def index
    @journals = Journal.all
---
SELECT "journals".* FROM "journals" ORDER BY "journals"."id" DESC

  def show
    @journal = Journal.find(params[:id])
---
SELECT  "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @journal = Journal.new(params_journal)

    if @journal.save
---
INSERT INTO "journals" ("reference", "date", "summary", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reference", "3"], ["date", "12-03-2019"], ["summary", "asdf"], ["amount", 2500], ["created_at", "2019-12-08 07:23:23.965307"], ["updated_at", "2019-12-08 07:23:23.965307"]]

  def edit
    @journal = Journal.find(params[:id])
---
SELECT  "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @journal = Journal.find(params[:id])
      if @journal.update(params_journal)
---
SELECT  "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "journals" SET "reference" = $1, "updated_at" = $2 WHERE "journals"."id" = $3  [["reference", "44"], ["updated_at", "2019-12-08 08:09:52.742364"], ["id", 4]]

  def destroy
    @journal = Journal.find(params[:id])
    @journal.destroy
---
SELECT  "journals".* FROM "journals" WHERE "journals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "journals" WHERE "journals"."id" = $1  [["id", 1]]