app/controllers/order_controller.rb

  def index
    @orders = Order.all.order(id: :asc).paginate(page: params[:page], per_page: 10)

    @all = Order.all.count;
    @pending = Order.where(:status => 'Pending').count;
    @shipped = Order.where(:status => 'Shipped').count;
    @completed = Order.where(:status => 'Completed').count;
    @returned = Order.where(:status => 'Returned').count;
---
SELECT COUNT(*) FROM "orders"
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = $1  [["status", "Shipped"]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = $1  [["status", "Completed"]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = $1  [["status", "Returned"]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = $1  [["status", "Canceled"]]