app/controllers/product_controller.rb

SELECT "orders".* FROM "orders" ORDER BY "orders"."id" ASC
SELECT COUNT(*) FROM "orders"
SELECT * FROM "vendors" INNER JOIN "products" ON "products"."vendor_id" = "vendors"."id"
SELECT SUM(amount) FROM "vendors" INNER JOIN "products" ON "products"."vendor_id" = "vendors"."id" INNER JOIN "orders" ON "orders"."product_id" = "products"."id" WHERE (orders.status = 'Completed' AND name ILIKE '%Airpod 2%')
---
  def index
    @products = Product.all.order(id: :asc).paginate(page: params[:page], per_page: 20)
    @vendors = Vendor.select("*").joins(:products).paginate(page: params[:page], per_page: 20)