app/controllers/profit_loss_controller.rb

SELECT SUM(amount) FROM "vendors" INNER JOIN "products" ON "products"."vendor_id" = "vendors"."id" INNER JOIN "orders" ON "orders"."product_id" = "products"."id" WHERE (orders.status = 'Completed' AND name ILIKE '%Airpod 2%')
---
  def search
    @search = params["search"]
    if @search.present?
      @mobile = @search["mobile"]
      @name = @search["name"]
      @orders = Vendor.select("*").joins(products: [:orders]).where("orders.status = 'Completed' AND name ILIKE ?", "%#{@name}%")

      @profit = Vendor.select("*").joins(products: [:orders]).where("orders.status = 'Completed' AND name ILIKE ?", "%#{@name}%").sum("amount");
      @loss = Vendor.select("*").joins(products: [:orders]).where("orders.status = 'Completed' AND name ILIKE ?", "%#{@name}%").sum("amount");

SELECT * FROM "vendors" INNER JOIN "products" ON "products"."vendor_id" = "vendors"."id" INNER JOIN "orders" ON "orders"."product_id" = "products"."id" WHERE (orders.status = 'Completed') ORDER BY "vendors"."id" ASC
SELECT SUM(amount) FROM "vendors" INNER JOIN "products" ON "products"."vendor_id" = "vendors"."id" INNER JOIN "orders" ON "orders"."product_id" = "products"."id" WHERE (orders.status = 'Completed' AND name ILIKE '%Airpod 2%')
SELECT SUM(amount) FROM "vendors" INNER JOIN "products" ON "products"."vendor_id" = "vendors"."id" INNER JOIN "orders" ON "orders"."product_id" = "products"."id"
SELECT SUM("orders"."amount") FROM "orders" WHERE "orders"."status" = $1  [["status", "Completed"]]
---
  def index
    @orders = Vendor.select("*").joins(products: [:orders]).where("orders.status = 'Completed'").order(id: :asc)

    @profit = Vendor.select("*").joins(products: [:orders]).sum("amount");
    @loss = Order.where(:status => 'Completed').sum("amount");